"""
Написати функцію, яка буде реалізувати логіку циклічного зсуву елементів в списку.
Тобто, функція приймає два аргументи: список і величину зсуву
(якщо ця величина додатня - пересуваємо з кінця на початок,
якщо від'ємна - навпаки - пересуваємо елементи з початку списку в його кінець).
Наприклад:
fnc([1, 2, 3, 4, 5], shift=1) --> [5, 1, 2, 3, 4]
fnc([1, 2, 3, 4, 5], shift=-2) --> [3, 4, 5, 1, 2]
"""


def shift(data_list, *, shift):
    return data_list[-shift:] + data_list[:-shift]


def main():
    input_data = [1, 2, 3, 4, 5]
    shift_size = int(input('[>] inser shift size: ').strip())

    print(shift(input_data, shift=shift_size))


if __name__ == '__main__':
    main()
